app/Controllers/Admisi.php

    public function datapasien()
    {
        // Load database
        $db = \Config\Database::connect();

        // Get data pasien dengan id untuk modal, hanya yang aktif
        $pasien = $db->table('pasien')
                    ->select('id, nama_lengkap, tempat_lahir, tanggal_lahir, nomor_hp')
                    ->where('status_aktif', 'aktif')
                    ->orderBy('nama_lengkap', 'ASC')
                    ->get()
                    ->getResultArray();
---
SELECT `id`, `nama_lengkap`, `tempat_lahir`, `tanggal_lahir`, `nomor_hp`
FROM `pasien`
WHERE `status_aktif` = 'aktif'
ORDER BY `nama_lengkap` ASC

    public function pasienHariIni()
    {
        // Load database
        $db = \Config\Database::connect();

        // Get pasien terdaftar hari ini dengan data lengkap
        $pasien_hari_ini = $db->table('pasien')
                    ->select('*')
                    ->where('DATE(tanggal_daftar)', date('Y-m-d'))
                    ->orderBy('tanggal_daftar', 'DESC')
                    ->get()
                    ->getResultArray();
---
SELECT *
FROM `pasien`
WHERE DATE(tanggal_daftar) = '2025-07-18'
ORDER BY `tanggal_daftar` DESC