app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
---
    public function profile()
    {
        if (!$this->session->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $userId = $this->session->get('user_id');
        $user = $this->userModel->find($userId);