app/Models/UserModel.php

    public function verifyUser($username, $password)
    {
        // Cari user berdasarkan username dan aktif
        $user = $this->where('username', $username)
                     ->where('status_aktif', 1)
                     ->first();

        // Jika user ditemukan dan password cocok
        if ($user && password_verify($password, $user['password'])) {
            // Update last login
            $this->update($user['id'], [
                'login_terakhir' => date('Y-m-d H:i:s')
            ]);
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
AND `status_aktif` = 1
 LIMIT 1
UPDATE `users` SET `login_terakhir` = '2025-07-18 09:46:21', `diperbarui_pada` = '2025-07-18 09:46:21'
WHERE `users`.`id` IN ('1')